package com.ohgiraffers.section2.demensinal;

public class Application1 {
    public static void main(String[] args) {
        /*
        * [다차원 배열]
        * 다차원 배열은 2차원 이상의 배열을 의미하며, 배열의 인덱스마다 또 다른 배열의 주소를 보관하는 배열이다.
        * 즉, 2차원 배열은 1차원 배열 여러개를 하나로 묶어서 관리하는 배열이다.
        * 일반적으로 2차원 배열 이상의 배열은 사용 빈도가 현저히 적다.
        *
        * [2차원 배열을 사용하는 방법]
        * 1. 배열의 주소를 보관할 래퍼런스 변수 선언(stack)
        * 2. 여러개의 1차원 배열의 주소를 관리할 배열 생성 (heap)
        * 3. 2에서 생성한 배열의 각 인덱스에서 관리하는 배열을 할당(heap)하여 주소를 보관하는 배열(= 2에서 생성한 배열)에 저장
        * 4. 생성한 여러개의 1차원 배열에 접근하여 사용
        * */




    }
}
